[{"playerid":"1","name":"Briana Keaveney","school":"Clarkstown South","year":"Senior","sport":"Softball","position":"Pitcher","chip":"The Rockland player of the year led the Vikings to their first-ever sectional and regional titles and state semifinal berth, going 22-2 this season including an extra innings no-hitter in the regional semifinal. The Cortland-bound senior battled through an ankle injury in the beginning of the season, but finished with an average of .538.","url":"Briana Keaveney.jpg","credit":"placeholder"},{"playerid":"2","name":"Diana King","school":"Rye Neck","year":"Senior","sport":"Softball","position":"Pitcher","chip":"King was one of the best all-around players in the section and state this season, pitching to a 20-3 record and a 1.03 ERA, while smashing nine homers and 42 RBI to go with a .653 average. The NYU-bound senior bounced back from a rough start against Valhalla earlier in the season to lead the Panthers to a Class B section title with a win over the Vikings.","url":"Diana King.jpg","credit":"placeholder"},{"playerid":"3","name":"Rai Benjamin","school":"Mount Vernon","year":"Senior","sport":"Track and field","position":"Runner","chip":"Benjamin, who’ll run for UCLA on a full scholarship next year, recorded the fastest times in Section 1  in the 100- and 200-meter dashes this spring and logged the fastest time in the state at 400 meters. At nationals, he ran a state-record 49.97 in the 400 hurdles, the seventh fastest time ever for a high school runner.","url":"Rai Benjamin.jpg","credit":"placeholder"},{"playerid":"4","name":"Eric Favors","school":"North Rockland","year":"Senior","sport":"Track and field","position":"Thrower","chip":"After recording a state-record indoor shot put throw in winter, the University of South Carolina-bound Favors won the state outdoor title this spring. He also had the state’s longest discus throw. Favors then recorded a personal best in the shot of 66 feet, seven inches at nationals, breaking a 39-year-old Rockland record.","url":"Eric Favors.jpg","credit":"placeholder"},{"playerid":"5","name":"Kamryn McIntosh","school":"Suffern","year":"Sophomore","sport":"Track and field","position":"Runner","chip":"One of the most talented runners in the country, the national record-holder for the indoor 600 meters won the state outdoor championship this spring at 800 meters and broke her own Rockland record in finishing fourth at nationals at 400 meters. She also anchored Suffern’s two national third-place relay squads.","url":"Kamryn McIntosh.jpg","credit":"placeholder"},{"playerid":"6","name":"Anna Flynn","school":"Ursuline","year":"Junior","sport":"Track and field","position":"Runner","chip":"Looking strong throughout the spring, Flynn clocked the fastest time among girls in Section 1 at 1,500 meters. She also posted the fastest time at 3,000 meters among girls in Westchester County, had the second fastest time in Westchester at 800 meters and was a huge part of Ursuline’s national relays.","url":"Anna Flynn.jpg","credit":"placeholder"},{"playerid":"7","name":"Kyle Michella","school":"North Rockland","year":"Junior","sport":"Boys lacrosse","position":"Attack","chip":"Despite constant attention from some of the best defenders in Section 1, Michella was a catalyst, whether scoring or passing. He finished with five goals and 10 assists in 21-20 loss at White Plains this season.","url":"Kyle Michella1.jpg","credit":"placeholder"},{"playerid":"8","name":"Josh Della Puca","school":"Pleasantville","year":"Senior","sport":"Boys lacrosse","position":"Midfield","chip":"The mind-over-matter Della Puca was a physical force and emotional leader for the Panthers. He took over against Bronxville in the Section 1 title game, getting three goals and three assists in the 9-7 win.","url":"Josh Della Puca.jpg","credit":"placeholder"},{"playerid":"9","name":"Frankie Vesuvio","school":"Byram","year":"Junior","sport":"Baseball","position":"Right-handed pitcher/centerfielder","chip":"Once known as a tremendous athlete who could throw hard, Vesuvio broke out this season to earn the distinction as perhaps the best five-tool player in Section 1. He converted from closer to ace starting pitcher, earning wins in the section final, regional final and state semifinals to lead the Bobcats to their first-ever Class A state championship. He also broke the school record for home runs in a season (7) while playing a strong defensive centerfield.","url":"Frankie Vesuvio.jpg","credit":"placeholder"},{"playerid":"10","name":"Christian Conklin","school":"Albertus magnus","year":"Senior","sport":"Baseball","position":"Centerfielder/left-handed pitcher","chip":"No player in Rockland County was as clutch as Conklin, who hit game-tying homers in the league championship game against Tappan Zee and in the regional final against Mattituck. He led the Class B champions in batting average (.463), hits (38), runs (34), RBI (22), stolen bases (7), doubles (10), triples (4) and homers (4).","url":"Christian Conklin.JPG","credit":"placeholder"},{"playerid":"11","name":"James Nicholas","school":"Scarsdale","year":"Senior","sport":"Golf","position":"","chip":"This three-sport all-state standout — a two-time Journal News Westchester/Putnam hockey player of the year — won the state golf tournament at Cornell’s Robert Trent Jones Golf Course by shooting even par in the final round. The Yale football commit saved a key shot in the first round with a now-viral pitch shot from the water.","url":"James Nicholas.JPG","credit":"placeholder"},{"playerid":"12","name":"Glenn Watson","school":"Pearl River","year":"Senior","sport":"Golf","position":"","chip":"Watson ranked third in the county and 20th overall in the section in scoring differential, but he also staked his claim as Rockland’s best in the postseason. The senior went out on top, shooting a 75 at Rotella Golf Course to win the county tournament by two shots. Watson also shot a season-best score of 1-under 35.","url":"Glenn Watson.jpg","credit":"placeholder"},{"playerid":"13","name":"Lauren Peter","school":"Carmel","year":"Freshman","sport":"Golf","position":"","chip":"The precocious Peter posted the section’s top scoring differential in the regular season before winning the Section 1 tournament in dramatic fashion. She birdied the 36th and final hole and then went on to place second at the state tournament by just one shot.","url":"Lauren Peter.jpg","credit":"placeholder"},{"playerid":"14","name":"Kim Harker","school":"Mahopac","year":"Senior","sport":"Girls lacrosse","position":"Midfield","chip":"The best player to ever come out Mahopac, Harker closed out her high school career on a high note, finishing with 100 goals and 25 assists in 20 games, and as the team's primary faceoff-taker, won 60 percent of draw controls. The Northwestern-bound All-American was the key cog that led Mahopac to upset wins over Mamaroneck and North Rockland in the sectional tournament.","url":"Kim Harker.JPG","credit":"placeholder"},{"playerid":"15","name":"Baley Parrott","school":"Suffern","year":"Senior","sport":"Girls lacrosse","position":"Midfield","chip":"A key player on both sides of the ball for the best team in Section 1, the speedy Parrott routinely was everywhere Suffern needed her to be on the field this season, from harassing opposing players on defense to running the offense from behind the net. The Ohio State-bound All-American was part of a Suffern dynasty that has won three consecutive sectional titles.","url":"","credit":"placeholder"},{"playerid":"16","name":"Hope and Courage Crawford","school":"Mamaroneck","year":"Junior and freshman","sport":"Boys tennis","position":"","chip":"In their first year with Mamaroneck after arriving from Georgia, the Crawford brothers accomplished their goal of winning the program's first-ever state title. The duo won the sectional title in comeback fashion over Horace Greeley's James and Jeremy Wei, and carried their excellent form through the state tournament to capture the doubles title.","url":"","credit":"placeholder"}]